app/Controllers/AuthController.php

    public function crearUsuario(){
        $POST = $this->request->getPost();
        $usuario = new UsuarioEntity($POST);
        $alertas = $usuario->validar_cuenta();
        if(empty($alertas)){
            $existeUsuario = $usuario->where("email", $usuario->email);
            if(!empty($existeUsuario)){
                $alertas["error"][] = "El usuario ya esta registrado";
            }else{
                $usuarioModel = new UsuarioModel();
                $usuario->password_encryptado();
                $usuarioModel->insert($usuario);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `email`, `password`) VALUES ('Fernando', 'Joachin', 'admin@correo.com', '$2y$10$9VLsltoHp59HGRX3Y8LDmuM0xV3d8ArFbZa08ceHsLj.aJOP0K85e')