app/Controllers/AuthController.php

    public function crear(){
        $usuario = new UsuarioEntity();

        if($this->request->getServer("REQUEST_METHOD") === "POST"){
            $POST = $this->request->getPost();
            $usuario = new UsuarioEntity($POST);
            if($this->validate([
                "nombre" => "required",
                "apellido" => "required",
                "email" => "required|valid_emails|is_unique[usuarios.email]",
                "password" => "required|matches[c-password]"
            ])){
                $usuarioModel = new UsuarioModel();
                $usuarioModel->insert($usuario);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `email`, `password`) VALUES ('Roberto', 'Joachin', 'correo2@correo.com', '$2y$10$ImS3YpL7RlO972T7K7zA.eyRk7UZDSwgvQVIopeksiaB1zVwu80Oi')