app/Controllers/PersonaController.php

SELECT *
FROM `personas`
---
    public function index(){
        $personaModel = new PersonaModel();
        $personas = $personaModel->findAll();