app/Controllers/ProductoController.php

    public function index(){
        $productoModel = new ProductoModel();
        //$productos = $productoModel->findAll();
        return view("pagina/inicio",[
            "productos" => $productoModel->paginate(1),
            "pager" => $productoModel->pager
        ]);
---
SELECT *
FROM `productos`
 LIMIT 3, 1
SELECT COUNT(*) AS `numrows`
FROM `productos`

    public function crear(){
        $alertas = [];
        $producto = new ProductoEntity();

        if($this->request->getServer("REQUEST_METHOD") === "POST"){
            $POST = $this->request->getPost();
            $producto = new ProductoEntity($POST);
            $alertas = $producto->validar_producto();
            if(empty($alertas)){
                $productoModel = new ProductoModel();
                $productoModel->insert($producto);
---
INSERT INTO `productos` (`nombre`, `precio`, `disponibles`) VALUES ('as2', '2', '2')

    public function editar($id){
        $alertas = [];
        $productoModel = new ProductoModel();
        $productoID = $productoModel->find($id);
        $producto = new ProductoEntity(get_object_vars($productoID));

        if($this->request->getServer("REQUEST_METHOD") === "POST"){
            $POST = $this->request->getPost();
            $producto = new ProductoEntity($POST);
            $alertas = $producto->validar_producto();
            if(empty($alertas)){
                $productoModel->update($id, $producto);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '1'
UPDATE `productos` SET `nombre` = 'Xbox Series X', `precio` = '8000', `disponibles` = '21'
WHERE `productos`.`id` IN ('1')